app/controllers/gauges_controller.rb

SELECT "gauges".* FROM "gauges" LIMIT 1
---
  def show
    ##@gauge = Gauge.find(:all, conditions: {size: params[:example1]}, order: ":div, :serial")
    @gauge = Gauge.all