app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "name" = 'New Name', "email" = 'new@example.com', "password_digest" = '$2a$10$eoANz9Hx0KTOgRoUJIXpl.61z/7stBunA39VhZKaSoKUTduARJ6.e', "remember_token" = '1KO1FeiOXJV15yfH9OLJ1A', "updated_at" = '2014-05-27 02:30:22.564295' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])